MorgothCreator/CppSDK/SDK/platform/stm32f4/interface/screen.cpp
/*
 * lcd_interface.c
 *
 * Created: 2/8/2013 10:26:43 PM
 *  Author: XxXx
 */

#include "include/stm32f4xx.h"
#include "driver/stm32f4xx_hal_dsi.h"
#include "driver/stm32f4xx_hal_dma2d.h"
#include "driver/stm32f4xx_hal_ltdc_ex.h"
#include "driver/stm32f4xx_hal_ltdc.h"
#include "driver/stm32f4xx_hal_gpio.h"
#include "driver/stm32f4xx_hal_rcc.h"
#include "driver/stm32f4xx_hal_cortex.h"
#include "driver/stm32f4xx_hal.h"
#include <interface/screen.h>
#include <api/io_handle.h>

#if (USE_EXT_RAM == 1)
#if defined(STM32F429I_DISCO)
#define LCD_FB_START_ADDRESS       ((uint32_t)0xD0000000)
#elif defined (STM32F469I_DISCO)
#define LCD_FB_START_ADDRESS       ((uint32_t)0xC0000000)
#endif

#if defined(STM32F429xx) || defined(STM32F439xx)|| defined(STM32F469xx) || defined(STM32F479xx)
/**
 * @brief  LCD FB_StartAddress
 */
/** @brief Maximum number of LTDC layers
 */
#define LTDC_MAX_LAYER_NUMBER             ((uint32_t) 2)
/** @brief LTDC Background layer index
 */
#define LTDC_ACTIVE_LAYER_BACKGROUND      ((uint32_t) 0)

/** @brief LTDC Foreground layer index
 */
#define LTDC_ACTIVE_LAYER_FOREGROUND      ((uint32_t) 1)

LTDC_HandleTypeDef LtdcHandler;
DMA2D_HandleTypeDef Dma2dHandle;

static void DMA2D_Config(void);

/**
 * @brief  This function handles LTDC Error interrupt Handler.
 * @note : Can be surcharged by application code implementation of the function.
 */

/*__weak void BSP_LCD_LTDC_ER_IRQHandler(void)
 {
 HAL_LTDC_IRQHandler(&(LtdcHandler));
 }*/

/**
 * @brief  Handles DMA2D interrupt request.
 * @note : Can be surcharged by application code implementation of the function.
 */
/*__weak void BSP_LCD_DMA2D_IRQHandler(void)
 {
 HAL_DMA2D_IRQHandler(&Dma2dHandle);
 }*/

/**
 * @brief  Handles LTDC interrupt request.
 * @note : Can be surcharged by application code implementation of the function.
 */
/*__weak void BSP_LCD_LTDC_IRQHandler(void)
 {
 HAL_LTDC_IRQHandler(&(LtdcHandler));
 }*/

/**
 * @brief  On Error Handler on condition TRUE.
 * @param  condition : Can be TRUE or FALSE
 * @retval None
 */
void OnError_Handler(uint32_t condition)
{
	if (condition)
	{
		//BSP_LED_On(LED3);
		while (1)
		{
			;
		} /* Blocking on error */
	}
}

/**
 * @brief  DMA2D Transfer completed callback
 * @param  hdma2d: DMA2D handle.
 * @note   This example shows a simple way to report end of DMA2D transfer, and
 *         you can add your own implementation.
 * @retval None
 */
void TransferComplete(DMA2D_HandleTypeDef *hdma2d)
{
	/* Turn LED1 On */
	//BSP_LED_On(LED1);
	/* The Blended image is now ready for display */
	//blended_image_ready = 1;
}
/**
 * @brief  DMA2D error callbacks
 * @param  hdma2d: DMA2D handle
 * @note   This example shows a simple way to report DMA2D transfer error, and you can
 *         add your own implementation.
 * @retval None
 */
static void TransferError(DMA2D_HandleTypeDef *hdma2d)
{
	/* Turn LED2 On */
	//BSP_LED_On(LED2);
}
/**
 * @brief  Converts a line to an ARGB8888 pixel format.
 * @param  pSrc: Pointer to source buffer
 * @param  pDst: Output color
 * @param  xSize: Buffer width
 * @param  ColorMode: Input color mode
 */
static void LL_ConvertLineToARGB8888(void *pSrc, void *pDst, uint32_t xSize,
		uint32_t ColorMode)
{
	/* Configure the DMA2D Mode, Color Mode and output offset */
	Dma2dHandle.Init.Mode = DMA2D_M2M_PFC;
	Dma2dHandle.Init.ColorMode = DMA2D_ARGB8888;
	Dma2dHandle.Init.OutputOffset = 0;

	/* Foreground Configuration */
	Dma2dHandle.LayerCfg[1].AlphaMode = DMA2D_NO_MODIF_ALPHA;
	Dma2dHandle.LayerCfg[1].InputAlpha = 0xFF;
	Dma2dHandle.LayerCfg[1].InputColorMode = ColorMode;
	Dma2dHandle.LayerCfg[1].InputOffset = 0;

	Dma2dHandle.Instance = DMA2D;

	/* DMA2D Initialization */
	if (HAL_DMA2D_Init(&Dma2dHandle) == HAL_OK)
	{
		if (HAL_DMA2D_ConfigLayer(&Dma2dHandle, 1) == HAL_OK)
		{
			if (HAL_DMA2D_Start(&Dma2dHandle, (uint32_t) pSrc, (uint32_t) pDst,
					xSize, 1) == HAL_OK)
			{
				/* Polling For DMA transfer */
				HAL_DMA2D_PollForTransfer(&Dma2dHandle, 10);
			}
		}
	}
}

/**
 * @brief  Draws a bitmap picture loaded in the internal Flash (32 bpp) in currently active layer.
 * @param  Xpos: Bmp X position in the LCD
 * @param  Ypos: Bmp Y position in the LCD
 * @param  pbmp: Pointer to Bmp picture address in the internal Flash
 */
void BSP_LCD_DrawBitmap(void *_pDisplay, uint32_t Xpos, uint32_t Ypos,
		uint8_t *pbmp)
{
	GI::Dev::Screen *pDisplay = (GI::Dev::Screen *) _pDisplay;
	uint32_t index = 0, width = 0, height = 0, bit_pixel = 0;
	uint32_t Address;
	uint32_t InputColorMode = 0;

	/* Get bitmap data address offset */
	index = *(volatile uint16_t *) (pbmp + 10);
	index |= (*(volatile uint16_t *) (pbmp + 12)) << 16;

	/* Read bitmap width */
	width = *(uint16_t *) (pbmp + 18);
	width |= (*(uint16_t *) (pbmp + 20)) << 16;

	/* Read bitmap height */
	height = *(uint16_t *) (pbmp + 22);
	height |= (*(uint16_t *) (pbmp + 24)) << 16;

	/* Read bit/pixel */
	bit_pixel = *(uint16_t *) (pbmp + 28);

	/* Set the address */
	Address = LtdcHandler.LayerCfg[0].FBStartAdress
			+ (((pDisplay->LcdTimings->X * Ypos) + Xpos) * (4));

	/* Get the layer pixel format */
	if ((bit_pixel / 8) == 4)
	{
		InputColorMode = CM_ARGB8888;
	}
	else if ((bit_pixel / 8) == 2)
	{
		InputColorMode = CM_RGB565;
	}
	else
	{
		InputColorMode = CM_RGB888;
	}

	/* Bypass the bitmap header */
	pbmp += (index + (width * (height - 1) * (bit_pixel / 8)));

	/* Convert picture to ARGB8888 pixel format */
	for (index = 0; index < height; index++)
	{
		/* Pixel format conversion */
		LL_ConvertLineToARGB8888((uint32_t *) pbmp, (uint32_t *) Address, width,
				InputColorMode);

		/* Increment the source and destination buffers */
		Address += (pDisplay->LcdTimings->X * 4);
		pbmp -= width * (bit_pixel / 8);
	}
}

/**
 * @brief  De-Initializes the BSP LCD Msp
 * Application can surcharge if needed this function implementation.
 */
__weak void BSP_LCD_MspDeInit(void)
{
	/** @brief Disable IRQ of LTDC IP */
	HAL_NVIC_DisableIRQ((IRQn_Type) LTDC_IRQn);

	/** @brief Disable IRQ of DMA2D IP */
	HAL_NVIC_DisableIRQ((IRQn_Type) DMA2D_IRQn);

#if defined(STM32F469xx) || defined(STM32F479xx)
	/** @brief Disable IRQ of DSI IP */
	HAL_NVIC_DisableIRQ((IRQn_Type) DSI_IRQn);
#endif

	/** @brief Force and let in reset state LTDC, DMA2D and DSI Host + Wrapper IPs */
	__HAL_RCC_LTDC_FORCE_RESET();
	__HAL_RCC_DMA2D_FORCE_RESET();
#if defined(STM32F469xx) || defined(STM32F479xx)
	__HAL_RCC_DSI_FORCE_RESET();
#endif

