MorgothCreator/CppSDK/SDK/platform/stm32f4/interface/screen.cpp
	/** @brief Disable the LTDC, DMA2D and DSI Host and Wrapper clocks */
	__HAL_RCC_LTDC_CLK_DISABLE();
	__HAL_RCC_DMA2D_CLK_DISABLE();
#if defined(STM32F469xx) || defined(STM32F479xx)
	__HAL_RCC_DSI_CLK_DISABLE();
#endif
}

/**
 * @brief  Initialize the BSP LCD Msp.
 * Application can surcharge if needed this function implementation
 */
__weak void BSP_LCD_MspInit(void)
{
	/** @brief Enable the LTDC clock */
	__HAL_RCC_LTDC_CLK_ENABLE()
	;

	/** @brief Toggle Sw reset of LTDC IP */
	__HAL_RCC_LTDC_FORCE_RESET();
	__HAL_RCC_LTDC_RELEASE_RESET();

	/** @brief Enable the DMA2D clock */
	__HAL_RCC_DMA2D_CLK_ENABLE()
	;

	/** @brief Toggle Sw reset of DMA2D IP */
	__HAL_RCC_DMA2D_FORCE_RESET();
	__HAL_RCC_DMA2D_RELEASE_RESET();

#if defined(STM32F469xx) || defined(STM32F479xx)
	/** @brief Enable DSI Host and wrapper clocks */
	__HAL_RCC_DSI_CLK_ENABLE()
	;

	/** @brief Soft Reset the DSI Host and wrapper */
	__HAL_RCC_DSI_FORCE_RESET();
	__HAL_RCC_DSI_RELEASE_RESET();
#endif
	/** @brief NVIC configuration for LTDC interrupt that is now enabled */
	HAL_NVIC_SetPriority((IRQn_Type) LTDC_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ((IRQn_Type) LTDC_IRQn);

	/** @brief NVIC configuration for DMA2D interrupt that is now enabled */
	HAL_NVIC_SetPriority((IRQn_Type) DMA2D_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ((IRQn_Type) DMA2D_IRQn);

#if defined(STM32F469xx) || defined(STM32F479xx)
	/** @brief NVIC configuration for DSI interrupt that is now enabled */
	HAL_NVIC_SetPriority((IRQn_Type) DSI_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ((IRQn_Type) DSI_IRQn);
#endif
}

/**
 * @brief  BSP LCD Reset
 *         Hw reset the LCD DSI activating its XRES signal (active low for some time)
 *         and desactivating it later.
 *         This signal is only cabled on Discovery Rev B and beyond.
 */
void BSP_LCD_Reset(void)
{
#if !defined(USE_STM32469I_DISCO_REVA) || !defined(STM32F429I_DISCO)
	GI::IO displayRst = GI::IO((char *)"disprst");
	displayRst.write(false);
	HAL_Delay(20); /* wait 20 ms */
	displayRst.write(true);
	HAL_Delay(10); /* wait 20 ms */

#if 0
	/* EVAL Rev B and beyond : reset the LCD by activation of XRES (active low) connected to PH7 */
	GPIO_InitTypeDef gpio_init_structure;

	__HAL_RCC_GPIOH_CLK_ENABLE()
	;

	/* Configure the GPIO on PH7 */
	gpio_init_structure.Pin = GPIO_PIN_7;
	gpio_init_structure.Mode = GPIO_MODE_OUTPUT_OD;
	gpio_init_structure.Pull = GPIO_NOPULL;
	gpio_init_structure.Speed = GPIO_SPEED_HIGH;

	HAL_GPIO_Init(GPIOH, &gpio_init_structure);

	/* Activate XRES active low */
	HAL_GPIO_WritePin(GPIOH, GPIO_PIN_7, GPIO_PIN_RESET);

	HAL_Delay(20); /* wait 20 ms */

	/* Desactivate XRES */
	HAL_GPIO_WritePin(GPIOH, GPIO_PIN_7, GPIO_PIN_SET);

	/* Wait for 10ms after releasing XRES before sending commands */
	HAL_Delay(10);
#endif
#else

#endif /* USE_STM32469I_DISCO_REVA == 0 */
}

/**
 * @brief  Initializes the LCD layers.
 * @param  LayerIndex: Layer foreground or background
 * @param  FB_Address: Layer frame buffer
 * @retval None
 */
void BSP_LCD_LayerDefaultInit(void *_pDisplay, uint16_t LayerIndex,
		uint32_t FB_Address)
{
	GI::Dev::Screen *pDisplay = (GI::Dev::Screen *) _pDisplay;
	LCD_LayerCfgTypeDef Layercfg;

	/* Layer Init */
	Layercfg.WindowX0 = 0;
	Layercfg.WindowX1 = pDisplay->LcdTimings->X;
	Layercfg.WindowY0 = 0;
	Layercfg.WindowY1 = pDisplay->LcdTimings->Y;
	Layercfg.PixelFormat = LTDC_PIXEL_FORMAT_ARGB8888;
	Layercfg.FBStartAdress = FB_Address;
	Layercfg.Alpha = 255;
	Layercfg.Alpha0 = 0;
	Layercfg.Backcolor.Blue = 0;
	Layercfg.Backcolor.Green = 0;
	Layercfg.Backcolor.Red = 0;
	Layercfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
	Layercfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
	Layercfg.ImageWidth = pDisplay->LcdTimings->X;
	Layercfg.ImageHeight = pDisplay->LcdTimings->Y;
	pDisplay->DisplayData = (volatile unsigned int*) FB_Address;

	HAL_LTDC_ConfigLayer(&LtdcHandler, &Layercfg, LayerIndex);
}

/**
 * @brief DMA2D configuration.
 * @note  This function Configure the DMA2D peripheral :
 *        1) Configure the Transfer mode as memory to memory with blending.
 *        2) Configure the output color mode as RGB565 pixel format.
 *        3) Configure the Foreground
 *          - Foreground image is loaded from FLASH memory (RGB565_240x130_2[])
 *          - constant alpha value (decreased to see the background)
 *          - color mode as RGB565 pixel format
 *        4) Configure the Background
 *          - Background image loaded from FLASH memory (RGB565_240x130_1[])
 *          - color mode as RGB565 pixel format
 * @retval
 *  None
 */
static void DMA2D_Config(void)
{
	HAL_StatusTypeDef hal_status = HAL_OK;

	/* Configure the DMA2D Mode, Color Mode and output offset */
	Dma2dHandle.Init.Mode = DMA2D_M2M_BLEND; /* DMA2D mode Memory to Memory with Blending */
	Dma2dHandle.Init.ColorMode = DMA2D_RGB565; /* output format of DMA2D */
	Dma2dHandle.Init.OutputOffset = 0x0; /* No offset in output */

	/* DMA2D Callbacks Configuration */
	Dma2dHandle.XferCpltCallback = TransferComplete;
	Dma2dHandle.XferErrorCallback = TransferError;

	/* Foreground layer Configuration */
	Dma2dHandle.LayerCfg[1].AlphaMode = DMA2D_REPLACE_ALPHA;
	Dma2dHandle.LayerCfg[1].InputAlpha = 0x7F; /* 127 : semi-transparent */
	Dma2dHandle.LayerCfg[1].InputColorMode = CM_RGB565;
	Dma2dHandle.LayerCfg[1].InputOffset = 0x0; /* No offset in input */

	/* Background layer Configuration */
	Dma2dHandle.LayerCfg[0].AlphaMode = DMA2D_REPLACE_ALPHA;
	Dma2dHandle.LayerCfg[0].InputAlpha = 0x7F; /* 127 : semi-transparent */
	Dma2dHandle.LayerCfg[0].InputColorMode = CM_RGB565;
	Dma2dHandle.LayerCfg[0].InputOffset = 0x0; /* No offset in input */

	Dma2dHandle.Instance = DMA2D;

	/* DMA2D Initialization */
	hal_status = HAL_DMA2D_Init(&Dma2dHandle);
	OnError_Handler(hal_status != HAL_OK);

	/* Apply DMA2D Foreground configuration */
	HAL_DMA2D_ConfigLayer(&Dma2dHandle, 1);

	/* Apply DMA2D Background configuration */
	HAL_DMA2D_ConfigLayer(&Dma2dHandle, 0);
}

#if defined(STM32F429xx) || defined(STM32F439xx)

#include <device/ili9341.h>
/**
 * @brief  Initializes the LCD.
 * @param  None
 * @retval LCD state
 */
uint8_t BSP_LCD_InitEx(void *_pDisplay)
{
	GI::Dev::Screen *pDisplay = (GI::Dev::Screen *) _pDisplay;
	/* On STM32F429I-DISCO, it is not possible to read ILI9341 ID because */
	/* PIN EXTC is not connected to VDD and then LCD_READ_ID4 is not accessible. */
	/* In this case, ReadID function is bypassed.*/
	/*if(ili9341_drv.ReadID() == ILI9341_ID)*/

	/* LTDC Configuration ----------------------------------------------------*/
	LtdcHandler.Instance = LTDC;

