MorgothCreator/CppSDK/SDK/platform/stm32f4/interface/screen.cpp
	/* Timing configuration  (Typical configuration from ILI9341 datasheet)
	 HSYNC=10 (9+1)
	 HBP=20 (29-10+1)
	 ActiveW=240 (269-20-10+1)
	 HFP=10 (279-240-20-10+1)

	 VSYNC=2 (1+1)
	 VBP=2 (3-2+1)
	 ActiveH=320 (323-2-2+1)
	 VFP=4 (327-320-2-2+1)
	 */

	/* Configure horizontal synchronization width */
	LtdcHandler.Init.HorizontalSync = pDisplay->LcdTimings->hsw;
	/* Configure vertical synchronization height */
	LtdcHandler.Init.VerticalSync = pDisplay->LcdTimings->vsw;
	/* Configure accumulated horizontal back porch */
	LtdcHandler.Init.AccumulatedHBP = pDisplay->LcdTimings->hbp;
	/* Configure accumulated vertical back porch */
	LtdcHandler.Init.AccumulatedVBP = pDisplay->LcdTimings->vbp;
	/* Configure accumulated active width */
	LtdcHandler.Init.AccumulatedActiveW = pDisplay->LcdTimings->X
			+ pDisplay->LcdTimings->hbp;
	/* Configure accumulated active height */
	LtdcHandler.Init.AccumulatedActiveH = pDisplay->LcdTimings->Y
			+ pDisplay->LcdTimings->vbp;
	/* Configure total width */
	LtdcHandler.Init.TotalWidth = pDisplay->LcdTimings->X
			+ pDisplay->LcdTimings->hbp + pDisplay->LcdTimings->hfp;
	/* Configure total height */
	LtdcHandler.Init.TotalHeigh = pDisplay->LcdTimings->Y
			+ pDisplay->LcdTimings->vbp + pDisplay->LcdTimings->vfp;

	/* Configure R,G,B component values for LCD background color */
	LtdcHandler.Init.Backcolor.Red = 0;
	LtdcHandler.Init.Backcolor.Blue = 0;
	LtdcHandler.Init.Backcolor.Green = 0;

	/* Polarity */
	LtdcHandler.Init.HSPolarity = LTDC_HSPOLARITY_AL;
	LtdcHandler.Init.VSPolarity = LTDC_VSPOLARITY_AL;
	LtdcHandler.Init.DEPolarity = LTDC_DEPOLARITY_AL;
	LtdcHandler.Init.PCPolarity = LTDC_PCPOLARITY_IPC;

	GPIO_InitTypeDef GPIO_InitStructure;

	/* Enable the LTDC and DMA2D Clock */
	__LTDC_CLK_ENABLE()
	;
	__DMA2D_CLK_ENABLE()
	;
	/* Enable GPIOs clock */
	__GPIOA_CLK_ENABLE()
	;
	__GPIOB_CLK_ENABLE()
	;
	__GPIOC_CLK_ENABLE()
	;
	__GPIOD_CLK_ENABLE()
	;
	__GPIOF_CLK_ENABLE()
	;
	__GPIOG_CLK_ENABLE()
	;

	/* GPIOs Configuration */
	/*
	 +------------------------+-----------------------+----------------------------+
	 +                       LCD pins assignment                                   +
	 +------------------------+-----------------------+----------------------------+
	 |  LCD_TFT R2 <-> PC.10  |  LCD_TFT G2 <-> PA.06 |  LCD_TFT B2 <-> PD.06      |
	 |  LCD_TFT R3 <-> PB.00  |  LCD_TFT G3 <-> PG.10 |  LCD_TFT B3 <-> PG.11      |
	 |  LCD_TFT R4 <-> PA.11  |  LCD_TFT G4 <-> PB.10 |  LCD_TFT B4 <-> PG.12      |
	 |  LCD_TFT R5 <-> PA.12  |  LCD_TFT G5 <-> PB.11 |  LCD_TFT B5 <-> PA.03      |
	 |  LCD_TFT R6 <-> PB.01  |  LCD_TFT G6 <-> PC.07 |  LCD_TFT B6 <-> PB.08      |
	 |  LCD_TFT R7 <-> PG.06  |  LCD_TFT G7 <-> PD.03 |  LCD_TFT B7 <-> PB.09      |
	 -------------------------------------------------------------------------------
	 |  LCD_TFT HSYNC <-> PC.06  | LCDTFT VSYNC <->  PA.04 |
	 |  LCD_TFT CLK   <-> PG.07  | LCD_TFT DE   <->  PF.10 |
	 -----------------------------------------------------
	 */

	/* GPIOA configuration */
	GPIO_InitStructure.Pin = GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_6 |
	GPIO_PIN_11 | GPIO_PIN_12;
	GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStructure.Pull = GPIO_NOPULL;
	GPIO_InitStructure.Speed = GPIO_SPEED_FAST;
	GPIO_InitStructure.Alternate = GPIO_AF14_LTDC;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);

	/* GPIOB configuration */
	GPIO_InitStructure.Pin = GPIO_PIN_8 |
	GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);

	/* GPIOC configuration */
	GPIO_InitStructure.Pin = GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_10;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);

	/* GPIOD configuration */
	GPIO_InitStructure.Pin = GPIO_PIN_3 | GPIO_PIN_6;
	HAL_GPIO_Init(GPIOD, &GPIO_InitStructure);

	/* GPIOF configuration */
	GPIO_InitStructure.Pin = GPIO_PIN_10;
	HAL_GPIO_Init(GPIOF, &GPIO_InitStructure);

	/* GPIOG configuration */
	GPIO_InitStructure.Pin = GPIO_PIN_6 | GPIO_PIN_7 |
	GPIO_PIN_11;
	HAL_GPIO_Init(GPIOG, &GPIO_InitStructure);

	/* GPIOB configuration */
	GPIO_InitStructure.Pin = GPIO_PIN_0 | GPIO_PIN_1;
	GPIO_InitStructure.Alternate = GPIO_AF9_LTDC;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);

	/* GPIOG configuration */
	GPIO_InitStructure.Pin = GPIO_PIN_10 | GPIO_PIN_12;
	HAL_GPIO_Init(GPIOG, &GPIO_InitStructure);

	/* Initialize the font */
	DMA2D_Config();
	HAL_LTDC_Init(&LtdcHandler);
	/* Initialize the font */
	BSP_LCD_LayerDefaultInit(_pDisplay, 0, LCD_FB_START_ADDRESS);

	ili9341_Init((char *)"spi-4.0", _pDisplay);


	pDisplay->sClipRegion.sXMin = 0;
	pDisplay->sClipRegion.sYMin = 0;
	pDisplay->sClipRegion.sXMax = pDisplay->LcdTimings->X;
	pDisplay->sClipRegion.sYMax = pDisplay->LcdTimings->Y;
	return LCD_OK;
}
#endif/*!defined(STM32F429xx) || !defined(STM32F439xx)*/

#endif

#if defined(USE_SCREEN_TYPE_DSI) && defined(STM32F469xx) || defined(STM32F479xx)

static DSI_VidCfgTypeDef hdsivideo_handle;
DSI_HandleTypeDef hdsi_eval;

void DSI_IO_WriteCmd(uint32_t NbrParams, uint8_t *pParams)
{
	if (NbrParams <= 1)
	{
		HAL_DSI_ShortWrite(&hdsi_eval, LCD_OTM8009A_ID,
				DSI_DCS_SHORT_PKT_WRITE_P1, pParams[0], pParams[1]);
	}
	else
	{
		HAL_DSI_LongWrite(&hdsi_eval, LCD_OTM8009A_ID, DSI_DCS_LONG_PKT_WRITE,
				NbrParams, pParams[NbrParams], pParams);
	}
}

/*******************************************************************************
 LTDC, DMA2D and DSI BSP Routines
 *******************************************************************************/

/**
 * @brief  Handles DSI interrupt request.
 * @note : Can be surcharged by application code implementation of the function.
 */
/*__weak void BSP_LCD_DSI_IRQHandler(void)
 {
 HAL_DSI_IRQHandler(&(hdsi_eval));
 }*/

#if defined(STM32F469xx) || defined(STM32F479xx)
/**
 * @brief  Initializes the DSI LCD.
 * The ititialization is done as below:
 *     - DSI PLL ititialization
 *     - DSI ititialization
 *     - LTDC ititialization
 *     - OTM8009A LCD Display IC Driver ititialization
 * @param  None
 * @retval LCD state
 */
uint8_t BSP_LCD_InitEx(void *_pDisplay)
{
	GI::Dev::Screen *pDisplay = (GI::Dev::Screen *) _pDisplay;
	DSI_PLLInitTypeDef dsiPllInit;
	memset(&dsiPllInit, 0, sizeof(DSI_PLLInitTypeDef));
	uint32_t LcdClock = 27429; /*!< LcdClk = 27429 kHz */
	uint32_t Clockratio = 0;
	uint32_t laneByteClk_kHz = 0;
	uint32_t VSA; /*!< Vertical start active time in units of lines */
	uint32_t VBP; /*!< Vertical Back Porch time in units of lines */
	uint32_t VFP; /*!< Vertical Front Porch time in units of lines */
	uint32_t VACT; /*!< Vertical Active time in units of lines = imageSize Y in pixels to display */
	uint32_t HSA; /*!< Horizontal start active time in units of lcdClk */
	uint32_t HBP; /*!< Horizontal Back Porch time in units of lcdClk */
	uint32_t HFP; /*!< Horizontal Front Porch time in units of lcdClk */
	uint32_t HACT; /*!< Horizontal Active time in units of lcdClk = imageSize X in pixels to display */

	/* Toggle Hardware Reset of the DSI LCD using
	 * its XRES signal (active low) */
	BSP_LCD_Reset();

	/* Call first MSP Initialize only in case of first initialization
	 * This will set IP blocks LTDC, DSI and DMA2D
	 * - out of reset
	 * - clocked
	 * - NVIC IRQ related to IP blocks enabled
	 */
	BSP_LCD_MspInit();

	/*************************DSI Initialization***********************************/

	/* Base address of DSI Host/Wrapper registers to be set before calling De-Init */
	hdsi_eval.Instance = DSI;

	HAL_DSI_DeInit(&(hdsi_eval));

